import { TService } from "./types";

export async function fetchServices(): Promise<TService[]> {
  return await Promise.resolve([ {
    "_id": "project",
    "title": "Разработка проекта",
    "type": "project",
    "intro": "Выбор готового проекта с внесением изменений по желанию, либо разработка полностью индивидуального проекта.",
    "text": "Изготовление индивидуальных проектов домов из двойного бруса, позволяет воплотить в жизнь все пожелания и мечты человека. Наша компания предлагает выполнить все работы по индивидуальному проектированию, учитывающему все требования к стилю дома, его планировке и экстерьеру. Выполняя заказ на индивидуальное планирование, нашими специалистами учитываются все факторы, такие как особенности площадки для строительства, рельефность местности, наличие инженерных коммуникаций и т.д.",
    "image": "services/project.jpg",
    "content": "<p><img alt='Индивидуальный проект' src='' style='width: 325px; height: 235px; margin-left: 5px; margin-right: 5px; float: left;'>Каждый человек, планирующий возвести собственный дом, сталкивается с проблемой изготовления проекта на проведение строительства.</p><p>Изготовление индивидуальных проектов домов из двойного бруса, позволяет воплотить в жизнь все пожелания и мечты человека. Наша компания предлагает выполнить все работы по индивидуальному проектированию, учитывающему все требования к стилю дома, его планировке и экстерьеру. Выполняя заказ на индивидуальное планирование, нашими специалистами учитываются все факторы, такие как особенности площадки для строительства, рельефность местности, наличие инженерных коммуникаций и т.д.</p><p>Разрабатывая индивидуальный проект дома мы учитываем не только этажность дома и его внешний вид, но также и выбор строительных материалов. Такой подход позволяет сэкономить значительную часть денежных средств, которые выделяются на строительство.</p><h4>Изготовление индивидуальных проектов обеспечивает:</h4><p><img alt='Изготовление проектов домов' src='' style='text-align: justify; width: 355px; height: 250px; margin: 5px; float: right;'></p><ul class='list'><li class='list__item'>эксклюзивность и неповторимость проекта, заказчик получает проект, который нигде не дублируется;</li><li class='list__item'>привязку к конкретному месту строительства с учетом всех особенностей;</li><li class='list__item'>учет всех потребностей и пожеланий;</li><li class='list__item'>отсутствие недостатков и необходимости изменений;</li><li class='list__item'>авторский надзор в процессе строительства.</li></ul><p>Чтобы заказать индивидуальный проект, достаточно заполнить имеющуюся на сайте форму в модуле на каждой странице сайта, после чего в самый короткий срок наши специалисты вам перезвонят. Всю информацию, связанную с вопросами проектирования, вы можете получить пор телефону или в офисе компании. Также вы можете воспользоваться услугой по вызову специалиста на личную встречу для обсуждения заказа, стоимости и сроков проведения проектных работ.</p>",
    "button": {
      "text": "Узнать больше"
    }
  },
  {
    "_id": "foundation",
    "title": "Монтаж фундамента",
    "type": "foundation",
    "intro": "Определиться с выбором фундамента вам помогут наши специалисты.",
    "text": "Существуют различные типы фундаментов, которые используются при строительстве домов по технологии двойного бруса. На строительство фундамента определенного типа влияет много факторов, которые необходимо учитывать при проектировании дома. К таким факторам можно отнести: расчетная нагрузка на основание, тип грунтов на которых планируется построить сооружений, наличие и уровень залегания грунтовых вод, рельеф местности и т. д.",
    "image": "services/foundation.jpg",
    "content": "<p><img alt='Индивидуальный проект' src='' style='width: 325px; height: 235px; margin-left: 5px; margin-right: 5px; float: left;'>Каждый человек, планирующий возвести собственный дом, сталкивается с проблемой изготовления проекта на проведение строительства.</p><p>Изготовление индивидуальных проектов домов из двойного бруса, позволяет воплотить в жизнь все пожелания и мечты человека. Наша компания предлагает выполнить все работы по индивидуальному проектированию, учитывающему все требования к стилю дома, его планировке и экстерьеру. Выполняя заказ на индивидуальное планирование, нашими специалистами учитываются все факторы, такие как особенности площадки для строительства, рельефность местности, наличие инженерных коммуникаций и т.д.</p><p>Разрабатывая индивидуальный проект дома мы учитываем не только этажность дома и его внешний вид, но также и выбор строительных материалов. Такой подход позволяет сэкономить значительную часть денежных средств, которые выделяются на строительство.</p><h4>Изготовление индивидуальных проектов обеспечивает:</h4><p><img alt='Изготовление проектов домов' src='' style='text-align: justify; width: 355px; height: 250px; margin: 5px; float: right;'></p><ul class='list'><li class='list__item'>эксклюзивность и неповторимость проекта, заказчик получает проект, который нигде не дублируется;</li><li class='list__item'>привязку к конкретному месту строительства с учетом всех особенностей;</li><li class='list__item'>учет всех потребностей и пожеланий;</li><li class='list__item'>отсутствие недостатков и необходимости изменений;</li><li class='list__item'>авторский надзор в процессе строительства.</li></ul><p>Чтобы заказать индивидуальный проект, достаточно заполнить имеющуюся на сайте форму в модуле на каждой странице сайта, после чего в самый короткий срок наши специалисты вам перезвонят. Всю информацию, связанную с вопросами проектирования, вы можете получить пор телефону или в офисе компании. Также вы можете воспользоваться услугой по вызову специалиста на личную встречу для обсуждения заказа, стоимости и сроков проведения проектных работ.</p>",
    "button": {
      "text": "Узнать больше"
    }
  },
  {
    "_id": "building",
    "title": "Сборка домокомплекта",
    "type": "building",
    "intro": "Великий Оксмокс предупреждал ее о злых запятых, диких знаках вопроса.",
    "content": "content",
    "button": {
      "text": "Узнать больше"
    }
  },
  {
    "_id": "heat-insulation",
    "title": "Утепление эковатой",
    "type": "heat-insulation",
    "intro": "Для утепления используется эковата, которая является сравнительно новым видом теплоизоляционных материалов.",
    "content": "content",
    "button": {
      "text": "Узнать больше"
    }
  },
  {
    "_id": "communication-tools",
    "title": "Коммуникации",
    "type": "communication-tools",
    "intro": "Прокладка коммуникаций производится в процессе монтажа стен. Трубы отопления, канализации и электрика...",
    "content": "content",
    "button": {
      "text": "Узнать больше"
    }
  },
  {
    "_id": "painting",
    "title": "Покраска дома",
    "type": "painting",
    "intro": "Окраска деревянного дома используется для эффективной защиты элементов строения от появления синевы...",
    "content": "content",
    "button": {
      "text": "Узнать больше"
    }
  }]);
}

export async function updateServices(services: TService[]) {
  console.log('Here will be functional for updating Slogan', services);
  return await Promise.resolve([ {
    "_id": "project",
    "title": "Разработка проекта444",
    "type": "project",
    "intro": "Выбор готового проекта с внесением изменений по желанию, либо разработка полностью индивидуального проекта.",
    "text": "Изготовление индивидуальных проектов домов из двойного бруса, позволяет воплотить в жизнь все пожелания и мечты человека. Наша компания предлагает выполнить все работы по индивидуальному проектированию, учитывающему все требования к стилю дома, его планировке и экстерьеру. Выполняя заказ на индивидуальное планирование, нашими специалистами учитываются все факторы, такие как особенности площадки для строительства, рельефность местности, наличие инженерных коммуникаций и т.д.",
    "image": "services/project.jpg",
    "content": "<p><img alt='Индивидуальный проект' src='' style='width: 325px; height: 235px; margin-left: 5px; margin-right: 5px; float: left;'>Каждый человек, планирующий возвести собственный дом, сталкивается с проблемой изготовления проекта на проведение строительства.</p><p>Изготовление индивидуальных проектов домов из двойного бруса, позволяет воплотить в жизнь все пожелания и мечты человека. Наша компания предлагает выполнить все работы по индивидуальному проектированию, учитывающему все требования к стилю дома, его планировке и экстерьеру. Выполняя заказ на индивидуальное планирование, нашими специалистами учитываются все факторы, такие как особенности площадки для строительства, рельефность местности, наличие инженерных коммуникаций и т.д.</p><p>Разрабатывая индивидуальный проект дома мы учитываем не только этажность дома и его внешний вид, но также и выбор строительных материалов. Такой подход позволяет сэкономить значительную часть денежных средств, которые выделяются на строительство.</p><h4>Изготовление индивидуальных проектов обеспечивает:</h4><p><img alt='Изготовление проектов домов' src='' style='text-align: justify; width: 355px; height: 250px; margin: 5px; float: right;'></p><ul class='list'><li class='list__item'>эксклюзивность и неповторимость проекта, заказчик получает проект, который нигде не дублируется;</li><li class='list__item'>привязку к конкретному месту строительства с учетом всех особенностей;</li><li class='list__item'>учет всех потребностей и пожеланий;</li><li class='list__item'>отсутствие недостатков и необходимости изменений;</li><li class='list__item'>авторский надзор в процессе строительства.</li></ul><p>Чтобы заказать индивидуальный проект, достаточно заполнить имеющуюся на сайте форму в модуле на каждой странице сайта, после чего в самый короткий срок наши специалисты вам перезвонят. Всю информацию, связанную с вопросами проектирования, вы можете получить пор телефону или в офисе компании. Также вы можете воспользоваться услугой по вызову специалиста на личную встречу для обсуждения заказа, стоимости и сроков проведения проектных работ.</p>",
    "button": {
      "text": "Узнать больше"
    }
  },
  {
    "_id": "foundation",
    "title": "Монтаж фундамента",
    "type": "foundation",
    "intro": "Определиться с выбором фундамента вам помогут наши специалисты.",
    "text": "Существуют различные типы фундаментов, которые используются при строительстве домов по технологии двойного бруса. На строительство фундамента определенного типа влияет много факторов, которые необходимо учитывать при проектировании дома. К таким факторам можно отнести: расчетная нагрузка на основание, тип грунтов на которых планируется построить сооружений, наличие и уровень залегания грунтовых вод, рельеф местности и т. д.",
    "image": "services/foundation.jpg",
    "content": "<p><img alt='Индивидуальный проект' src='' style='width: 325px; height: 235px; margin-left: 5px; margin-right: 5px; float: left;'>Каждый человек, планирующий возвести собственный дом, сталкивается с проблемой изготовления проекта на проведение строительства.</p><p>Изготовление индивидуальных проектов домов из двойного бруса, позволяет воплотить в жизнь все пожелания и мечты человека. Наша компания предлагает выполнить все работы по индивидуальному проектированию, учитывающему все требования к стилю дома, его планировке и экстерьеру. Выполняя заказ на индивидуальное планирование, нашими специалистами учитываются все факторы, такие как особенности площадки для строительства, рельефность местности, наличие инженерных коммуникаций и т.д.</p><p>Разрабатывая индивидуальный проект дома мы учитываем не только этажность дома и его внешний вид, но также и выбор строительных материалов. Такой подход позволяет сэкономить значительную часть денежных средств, которые выделяются на строительство.</p><h4>Изготовление индивидуальных проектов обеспечивает:</h4><p><img alt='Изготовление проектов домов' src='' style='text-align: justify; width: 355px; height: 250px; margin: 5px; float: right;'></p><ul class='list'><li class='list__item'>эксклюзивность и неповторимость проекта, заказчик получает проект, который нигде не дублируется;</li><li class='list__item'>привязку к конкретному месту строительства с учетом всех особенностей;</li><li class='list__item'>учет всех потребностей и пожеланий;</li><li class='list__item'>отсутствие недостатков и необходимости изменений;</li><li class='list__item'>авторский надзор в процессе строительства.</li></ul><p>Чтобы заказать индивидуальный проект, достаточно заполнить имеющуюся на сайте форму в модуле на каждой странице сайта, после чего в самый короткий срок наши специалисты вам перезвонят. Всю информацию, связанную с вопросами проектирования, вы можете получить пор телефону или в офисе компании. Также вы можете воспользоваться услугой по вызову специалиста на личную встречу для обсуждения заказа, стоимости и сроков проведения проектных работ.</p>",
    "button": {
      "text": "Узнать больше"
    }
  },
  {
    "_id": "building",
    "title": "Сборка домокомплекта888",
    "type": "building",
    "intro": "Великий Оксмокс предупреждал ее о злых запятых, диких знаках вопроса.",
    "content": "content",
    "button": {
      "text": "Узнать больше"
    }
  },
  {
    "_id": "heat-insulation",
    "title": "Утепление эковатой",
    "type": "heat-insulation",
    "intro": "Для утепления используется эковата, которая является сравнительно новым видом теплоизоляционных материалов.",
    "content": "content",
    "button": {
      "text": "Узнать больше"
    }
  },
  {
    "_id": "communication-tools",
    "title": "Коммуникации",
    "type": "communication-tools",
    "intro": "Прокладка коммуникаций производится в процессе монтажа стен. Трубы отопления, канализации и электрика...",
    "content": "content",
    "button": {
      "text": "Узнать больше"
    }
  },
  {
    "_id": "painting",
    "title": "Покраска дома",
    "type": "painting",
    "intro": "Окраска деревянного дома используется для эффективной защиты элементов строения от появления синевы...",
    "content": "content",
    "button": {
      "text": "Узнать больше"
    }
  }]);
  
}